// 中英文数字下划线，”-“，“\”，"/"
export const regOfNameTest = /^[a-zA-Z0-9_\u4e00-\u9fa5\-\/\\]+$/;

// 中英文、数字、下划线、“/”、“:”、“.”
export const regFilePath = /^[a-zA-Z0-9_\u4e00-\u9fa5\:\.\/]+$/;

//描述信息
//工序的名字限制 汉字、字母(不区分大小写)、数字、_
export const name1 = /^[a-zA-Z0-9_\u4e00-\u9fa5\_]+$/;

// 汉字、字母(不区分大小写)、数字、“_”、"，"、"。"、"？"、" "、"："
// 语音信息
export const viceTest = /^[a-zA-Z0-9_\u4e00-\u9fa5\_\，\。\？\ \：]+$/;

//样本数量数字输入
export const numTestFor1 = /^([1-9][0-9]{0,5}|1000000)$/;

//帧率
export const fpsTest = /^([1-9]|[1-2][0-9]|30)$/;

//拍摄场景设置 汉字、字母(不区分大小写)、数字、_
export const sheetTest = /^[a-zA-Z0-9_\u4e00-\u9fa5\_]+$/;

//描述信息 请输入中文，英文，和中英文标点符号
export const discriptTest = /^[\u4e00-\u9fa5_a-zA-Z0-9\s\·\~\！\@\#\￥\%\……\&\*\（\）\——\-\+\=\【\】\{\}\、\|\；\‘\’\：\“\”\《\》\？\，\。\、\`\~\!\#\$\%\^\&\*\(\)\_\[\]{\}\\\|\;\'\'\:\"\"\,\.\/\<\>\?]+$/;

//未通过理由验证 汉字、字母(不区分大小写)、数字、“_”、"，"  “。”
export const regOfNoPassTest = /^[a-zA-Z0-9_\u4e00-\u9fa5\，\。]+$/;

//身份证-18位，数字、字母(不区分大小写)
export const regOfidentityCard = /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/;

//电话号码11位，数字
export const regOfTel = /^1[3456789]\d{9}$/;

//邮箱正则，xxxyyy@zzz.com.cn
//其中"x"可以是纯数字，也可以是纯字母，也可以是数字与字母的组合；
//"y"可以是纯数字，可以是纯字母，也可以是数字、字母和指定字符(-_)的组合；x+y至少3位
//"z"可以是纯数字，可以是纯字母，也可以是数字、字母和指定字符"-"的组合， 但不能以字符"-"开头
//最后的.com和.cn是可以互换位置的，然后也可以只有.com没有.cn或只有.cn没有.com,也可以是其他的,2-3位
export const regOfEmail = /^[A-Za-z0-9]([-\w.+]{2,})@[A-Za-z0-9]([-A-Za-z0-9]{1,})(\.[A-Za-z]{2,3}){0,2}$/;

//用户名称（登录名）：英文(区分大小写)，数字
export const regOfLoginName = /^[a-zA-Z0-9]{1,}$/;

//姓名：汉字、字母(不区分大小写)、数字、下划线
export const regOfName = /^[a-zA-Z0-9_\u4e00-\u9fa5]{0,}$/;

//汉字、字母(不区分大小写)、数字、下划线 且限制在20个字符内
export const regOf20 = /^[a-zA-Z0-9_\u4e00-\u9fa5]{0,20}$/;

// 标志物名称：1-50位中文，大小写英文，数字，下划线(_)，减号(-)，斜杠(\)，反斜杠（/）
export const labelNameTest = /^[a-zA-Z0-9_\u4e00-\u9fa5\_\-\/\\\-\——]+$/;

//判定规范名称
export const jugNameTest = /^[a-zA-Z0-9_\u4e00-\u9fa5\_\-\/\\\-\——]+$/;

// label名称：1-50位，大小写英文，数字，下划线(_)，减号(-)，斜杠(\)，反斜杠（/）
export const labelNameNoZhTest = /^[a-zA-Z0-9_\_\-\/\\\-\——]+$/;

//密码，至少两种字符
export const passwordTest = /^(?![0-9]+$)(?![a-z]+$)(?![A-Z]+$)(?!([\(])+$)(?!([\)])+$)(?!([^(0-9a-zA-Z)])+$)^.{1,}$/;

//普通文本框 汉字、英文、数字、_、-  下划线、中划线
export const inputTest = /^[a-zA-Z0-9_\u4e00-\u9fa5\_\-]+$/;

//登录名 英文、数字
export const loginNameTest = /^[a-zA-Z0-9]+$/;

//姓名 汉字、英文、数字
export const nameTest = /^[a-zA-Z0-9\u4e00-\u9fa5]+$/;

//作业管理平台IP
export const IPTest = /^((2(5[0-5]|[0-4]\d))|[0-1]?\d{1,2})(\.((2(5[0-5]|[0-4]\d))|[0-1]?\d{1,2})){3}$/;

//作业管理平台域名
export const domainTest = /^[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+\.?$/;
